snavien/EEC172/labs/Examples/TIMER/Timer/startup_mb9bf56x.s
; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main

                LDR.W R0, =0xE000ED88            ; CPACR is located at address 0xE000ED88
                LDR R1, [R0]                     ; Read CPACR
                ORR R1, R1, #(0xF << 20)         ; Set bits 20-23 to enable CP10 and CP11 coprocessors
                STR R1, [R0]                     ; Write back the modified value to the CPACR

                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP


; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler               [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler          [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler        [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler               [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler          [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler            [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler           [WEAK]
                B       .
                ENDP

Default_Handler PROC

                EXPORT  CSV_IRQHandler	          [WEAK]
                EXPORT  SWDT_IRQHandler	          [WEAK]
                EXPORT  LVD_IRQHandler	          [WEAK]
                EXPORT  IRQ003SEL_IRQHandler	          [WEAK]
                EXPORT  IRQ004SEL_IRQHandler	          [WEAK]
                EXPORT  IRQ005SEL_IRQHandler	          [WEAK]
                EXPORT  IRQ006SEL_IRQHandler	          [WEAK]
                EXPORT  IRQ007SEL_IRQHandler	          [WEAK]
                EXPORT  IRQ008SEL_IRQHandler	          [WEAK]
                EXPORT  IRQ009SEL_IRQHandler	          [WEAK]
                EXPORT  IRQ010SEL_IRQHandler	          [WEAK]
                EXPORT  EXINT0_IRQHandler	          [WEAK]
                EXPORT  EXINT1_IRQHandler	          [WEAK]
                EXPORT  EXINT2_IRQHandler	          [WEAK]
                EXPORT  EXINT3_IRQHandler	          [WEAK]
                EXPORT  EXINT4_IRQHandler	          [WEAK]
                EXPORT  EXINT5_IRQHandler	          [WEAK]
                EXPORT  EXINT6_IRQHandler	          [WEAK]
                EXPORT  EXINT7_IRQHandler	          [WEAK]
                EXPORT  QPRC0_IRQHandler	          [WEAK]
                EXPORT  QPRC1_IRQHandler	          [WEAK]
                EXPORT  WFG0_DTIF0_IRQHandler	          [WEAK]
                EXPORT  WFG1_DTIF1_IRQHandler	          [WEAK]
                EXPORT  WFG2_DTIF2_IRQHandler	          [WEAK]
                EXPORT  FRT0_PEAK_IRQHandler	          [WEAK]
                EXPORT  FRT0_ZERO_IRQHandler	          [WEAK]
                EXPORT  ICU0_IRQHandler	          [WEAK]
                EXPORT  OCU0_IRQHandler	          [WEAK]
                EXPORT  FRT1_PEAK_IRQHandler	          [WEAK]
                EXPORT  FRT1_ZERO_IRQHandler	          [WEAK]
                EXPORT  ICU1_IRQHandler	          [WEAK]
                EXPORT  OCU1_IRQHandler	          [WEAK]
                EXPORT  FRT2_PEAK_IRQHandler	          [WEAK]
                EXPORT  FRT2_ZERO_IRQHandler	          [WEAK]
                EXPORT  ICU2_IRQHandler	          [WEAK]
                EXPORT  OCU2_IRQHandler	          [WEAK]
                EXPORT  PPG00_02_04_IRQHandler	          [WEAK]
                EXPORT  PPG08_10_12_IRQHandler	          [WEAK]
                EXPORT  PPG16_18_20_IRQHandler	          [WEAK]
                EXPORT  BT0_IRQHandler	          [WEAK]
                EXPORT  BT1_IRQHandler	          [WEAK]
                EXPORT  BT2_IRQHandler	          [WEAK]
                EXPORT  BT3_IRQHandler	          [WEAK]
                EXPORT  BT4_IRQHandler	          [WEAK]
                EXPORT  BT5_IRQHandler	          [WEAK]
                EXPORT  BT6_IRQHandler	          [WEAK]
                EXPORT  BT7_IRQHandler	          [WEAK]
                ;EXPORT  DT1_2_IRAHandler	          [WEAK]
                EXPORT  WC_IRQHandler	          [WEAK]
                EXPORT  EXTBUS_ERR_Handler	          [WEAK]
                EXPORT  RTC_IRQHandler	          [WEAK]
                EXPORT  EXTINT8_IRQHandler	          [WEAK]
                EXPORT  EXTINT9_IRQHandler	          [WEAK]
                EXPORT  EXTINT10_IRQHandler	          [WEAK]
                EXPORT  EXTINT11_IRQHandler	          [WEAK]
                EXPORT  EXTINT12_IRQHandler	          [WEAK]
                EXPORT  EXTINT13_IRQHandler	          [WEAK]
                EXPORT  EXTINT14_IRQHandler	          [WEAK]
                EXPORT  EXTINT15_IRQHandler	          [WEAK]
                EXPORT  TIM_IRQHandler	          [WEAK]
                EXPORT  MFS0_RX_IRQHandler	          [WEAK]
                EXPORT  MFS0_TX_IRQHandler	          [WEAK]
                EXPORT  MFS1_RX_IRQHandler	          [WEAK]
                EXPORT  MFS1_TX_IRQHandler	          [WEAK]
                EXPORT  MFS2_RX_IRQHandler	          [WEAK]
                EXPORT  MFS2_TX_IRQHandler	          [WEAK]
                EXPORT  MFS3_RX_IRQHandler	          [WEAK]
                EXPORT  MFS3_TX_IRQHandler	          [WEAK]
                EXPORT  MFS4_RX_IRQHandler	          [WEAK]
                EXPORT  MFS4_TX_IRQHandler	          [WEAK]
                EXPORT  MFS5_RX_IRQHandler	          [WEAK]
                EXPORT  MFS5_TX_IRQHandler	          [WEAK]
                EXPORT  MFS6_RX_IRQHandler	          [WEAK]
                EXPORT  MFS6_TX_IRQHandler	          [WEAK]
                EXPORT  MFS7_RX_IRQHandler	          [WEAK]
                EXPORT  MFS7_TX_IRQHandler	          [WEAK]
                EXPORT  ADC0_IRQHandler	          [WEAK]
                EXPORT  ADC1_IRQHandler	          [WEAK]
                EXPORT  USB0_IRQHandler	          [WEAK]
                EXPORT  USB0_HOST_IRQHandler	          [WEAK]
                EXPORT  CAN0_IRQHandler	          [WEAK]
                EXPORT  CAN1_IRQHandler	          [WEAK]
                EXPORT  ETHER0_IRQHandler	          [WEAK]
                EXPORT  DMAC0_IRQHandler	          [WEAK]
                EXPORT  DMAC1_IRQHandler	          [WEAK]
                EXPORT  DMAC2_IRQHandler	          [WEAK]
                EXPORT  DMAC3_IRQHandler	          [WEAK]
                EXPORT  DMAC4_IRQHandler	          [WEAK]
                EXPORT  DMAC5_IRQHandler	          [WEAK]
                EXPORT  DMAC6_IRQHandler	          [WEAK]
                EXPORT  DMAC7_IRQHandler	          [WEAK]
                EXPORT  DSTC_IRQHandler	          [WEAK]
                EXPORT  EXINT16_17_18_19_IRQHandler	          [WEAK]
                EXPORT  EXINT20_21_22_23_IRQHandler	          [WEAK]
                EXPORT  EXINT24_25_26_27_IRQHandler	          [WEAK]
                EXPORT  EXINT28_29_30_31_IRQHandler	          [WEAK]
                EXPORT  QPRC2_IRQHandler	          [WEAK]
                EXPORT  QPRC3_IRQHandler	          [WEAK]
                EXPORT  BT8_IRQHandler	          [WEAK]
                EXPORT  BT9_IRQHandler	          [WEAK]
                EXPORT  BT10_IRQHandler	          [WEAK]
                EXPORT  BT11_IRQHandler	          [WEAK]
                EXPORT  BT12_15_IRQHandler	          [WEAK]
                EXPORT  MFS8_RX_IRQHandler	          [WEAK]
                EXPORT  MFS8_TX_IRQHandler	          [WEAK]
                EXPORT  MFS9_RX_IRQHandler	          [WEAK]
                EXPORT  MFS9_TX_IRQHandler	          [WEAK]
                EXPORT  MFS10_RX_IRQHandler	          [WEAK]
                EXPORT  MFS10_TX_IRQHandler	          [WEAK]
                EXPORT  MFS11_RX_IRQHandler	          [WEAK]
                EXPORT  MFS11_TX_IRQHandler	          [WEAK]
                EXPORT  ADC2_IRQHandler	          [WEAK]
                EXPORT  USB1_IRQHandler	          [WEAK]
                EXPORT  USB1_HOST_IRQHandler	          [WEAK]
                EXPORT  SD_IRQHandler	          [WEAK]
                EXPORT  FLASHIF_IRQHandler	          [WEAK]
                EXPORT  MFS12_RX_IRQHandler	          [WEAK]
                EXPORT  MFS12_TX_IRQHandler	          [WEAK]
                EXPORT  MFS13_RX_IRQHandler	          [WEAK]
                EXPORT  MFS13_TX_IRQHandler	          [WEAK]
                EXPORT  MFS14_RX_IRQHandler	          [WEAK]
                EXPORT  MFS14_TX_IRQHandler	          [WEAK]
                EXPORT  MFS15_RX_IRQHandler	          [WEAK]
                EXPORT  MFS15_TX_IRQHandler	          [WEAK]
                EXPORT  Dummy	          [WEAK]



CSV_IRQHandler
SWDT_IRQHandler
LVD_IRQHandler
IRQ003SEL_IRQHandler
IRQ004SEL_IRQHandler
IRQ005SEL_IRQHandler
IRQ006SEL_IRQHandler
IRQ007SEL_IRQHandler
IRQ008SEL_IRQHandler
IRQ009SEL_IRQHandler
IRQ010SEL_IRQHandler
EXINT0_IRQHandler
EXINT1_IRQHandler
EXINT2_IRQHandler
EXINT3_IRQHandler
EXINT4_IRQHandler
EXINT5_IRQHandler
EXINT6_IRQHandler
EXINT7_IRQHandler
QPRC0_IRQHandler
QPRC1_IRQHandler
WFG0_DTIF0_IRQHandler
WFG1_DTIF1_IRQHandler
WFG2_DTIF2_IRQHandler
FRT0_PEAK_IRQHandler
FRT0_ZERO_IRQHandler
ICU0_IRQHandler
OCU0_IRQHandler
FRT1_PEAK_IRQHandler
FRT1_ZERO_IRQHandler
ICU1_IRQHandler
OCU1_IRQHandler
FRT2_PEAK_IRQHandler
FRT2_ZERO_IRQHandler
ICU2_IRQHandler
OCU2_IRQHandler
PPG00_02_04_IRQHandler
PPG08_10_12_IRQHandler
PPG16_18_20_IRQHandler
BT0_IRQHandler
BT1_IRQHandler
BT2_IRQHandler
BT3_IRQHandler
BT4_IRQHandler
BT5_IRQHandler
BT6_IRQHandler
BT7_IRQHandler
;DT1_2_IRAHandler
WC_IRQHandler
EXTBUS_ERR_Handler
RTC_IRQHandler
EXTINT8_IRQHandler
EXTINT9_IRQHandler
EXTINT10_IRQHandler
EXTINT11_IRQHandler
EXTINT12_IRQHandler
EXTINT13_IRQHandler
EXTINT14_IRQHandler
EXTINT15_IRQHandler
TIM_IRQHandler
MFS0_RX_IRQHandler
MFS0_TX_IRQHandler
MFS1_RX_IRQHandler
MFS1_TX_IRQHandler
MFS2_RX_IRQHandler
MFS2_TX_IRQHandler
MFS3_RX_IRQHandler
MFS3_TX_IRQHandler
MFS4_RX_IRQHandler
MFS4_TX_IRQHandler
MFS5_RX_IRQHandler
MFS5_TX_IRQHandler
MFS6_RX_IRQHandler
MFS6_TX_IRQHandler
MFS7_RX_IRQHandler
MFS7_TX_IRQHandler
ADC0_IRQHandler
ADC1_IRQHandler
USB0_IRQHandler
USB0_HOST_IRQHandler
CAN0_IRQHandler
CAN1_IRQHandler
ETHER0_IRQHandler
DMAC0_IRQHandler
DMAC1_IRQHandler
DMAC2_IRQHandler
DMAC3_IRQHandler
DMAC4_IRQHandler
DMAC5_IRQHandler
DMAC6_IRQHandler
DMAC7_IRQHandler
DSTC_IRQHandler
EXINT16_17_18_19_IRQHandler
EXINT20_21_22_23_IRQHandler
EXINT24_25_26_27_IRQHandler
EXINT28_29_30_31_IRQHandler
QPRC2_IRQHandler
QPRC3_IRQHandler
BT8_IRQHandler
BT9_IRQHandler
BT10_IRQHandler
BT11_IRQHandler
BT12_15_IRQHandler
MFS8_RX_IRQHandler
MFS8_TX_IRQHandler
MFS9_RX_IRQHandler
MFS9_TX_IRQHandler
MFS10_RX_IRQHandler
MFS10_TX_IRQHandler
MFS11_RX_IRQHandler
MFS11_TX_IRQHandler
ADC2_IRQHandler
USB1_IRQHandler
USB1_HOST_IRQHandler
SD_IRQHandler
FLASHIF_IRQHandler
MFS12_RX_IRQHandler
MFS12_TX_IRQHandler
MFS13_RX_IRQHandler
MFS13_TX_IRQHandler
MFS14_RX_IRQHandler
MFS14_TX_IRQHandler
MFS15_RX_IRQHandler
MFS15_TX_IRQHandler
Dummy


                B       .

                ENDP


                ALIGN


; User Initial Stack & Heap

                IF      :DEF:__MICROLIB
                
                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit
                
                ELSE
                
                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap
__user_initial_stackheap

                LDR     R0, = Heap_Mem
                LDR     R1, = (Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem + Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR

                ALIGN

                ENDIF


                END
